Masmiseim36/nxpSDK/devices/MIMXRT758S/iar/startup_MIMXRT758S_cm33_core1.s
; -------------------------------------------------------------------------
;  @file:    startup_MIMXRT758S_cm33_core1.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            MIMXRT758S_cm33_core1
;  @version: 2.0
;  @date:    2024-5-28
;  @build:   b241121
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2024 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)
        SECTION RO:CODE:NOROOT(2)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

;;The vector table is not needed for initialization.
__iar_init$$done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
        DCD     0x180000 ;Image length
#else
        DCD     sfe(RO) - __vector_table ;Image length
#endif
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     __vector_table                                ;Image load address
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     Reserved16_IRQHandler                         ;Reserved interrupt 16
        DCD     Reserved17_IRQHandler                         ;Reserved interrupt 17
        DCD     Reserved18_IRQHandler                         ;Reserved interrupt 18
        DCD     FRO2_IRQHandler                               ;FRO: 300MHz FRO in VDD1 domain Async interrupt
        DCD     GLIKEY4_IRQHandler                            ;GLIKEY: Interrupt
        DCD     UTICK1_IRQHandler                             ;Micro-tick Timer
        DCD     MRT1_IRQHandler                               ;MRT: Ored Interrupt request
        DCD     CTIMER5_IRQHandler                            ;CTIMER: Interrupt request
        DCD     CTIMER6_IRQHandler                            ;CTIMER: Interrupt request
        DCD     CTIMER7_IRQHandler                            ;CTIMER: Interrupt request
        DCD     LPI2C15_IRQHandler                            ;LPI2C: Interrupt request
        DCD     LP_FLEXCOMM17_IRQHandler                      ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM18_IRQHandler                      ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM19_IRQHandler                      ;FLEXCOMM: Interrupt request
        DCD     LP_FLEXCOMM20_IRQHandler                      ;FLEXCOMM: Interrupt request
        DCD     ADC_IRQHandler                                ;ADC0: Interrupt request
        DCD     SDADC_IRQHandler                              ;SDADC0: Interrupt request
        DCD     GLIKEY1_IRQHandler                            ;GLIKEY: Interrupt
        DCD     ACMP_IRQHandler                               ;ACMP: interrupt request
        DCD     PDM_EVENT_IRQHandler                          ;MIC: Interrupt request for read data or Error
        DCD     HYPERVISOR_IRQHandler                         ;SECURE: Sense domain Hypervisor interrupt
        DCD     SECURE_VIOLATION_IRQHandler                   ;SECURE: Sense domain Secure violation interrupt
        DCD     PDM_HWVAD_EVENT_IRQHandler                    ;MIC: Hardware Voice Activity Detector interrupt or error interrupt
        DCD     RTC1_ALARM_IRQHandler                         ;RTC: Alarm interrupt
        DCD     RTC1_IRQHandler                               ;RTC: wakeup interrupt to Sense domain
        DCD     HIFI1_IRQHandler                              ;HIFI1: Interrupt request
        DCD     MU1_B_IRQHandler                              ;MU1: MUB, CPU1 to CPU0
        DCD     Reserved43_IRQHandler                         ;Reserved interrupt
        DCD     MU3_A_IRQHandler                              ;MU3: MUA, CPU1 to HiFi1
        DCD     PMC_IRQHandler                                ;PMC: Sense domain Interrupt
        DCD     OS_EVENT_IRQHandler                           ;OSEVENT: Event timer CPU1 Wakeup/interrupt
        DCD     USDHC0_IRQHandler                             ;USDHC: Interrupt request
        DCD     USDHC1_IRQHandler                             ;USDHC: Interrupt request
        DCD     I3C2_IRQHandler                               ;I3C: Interrupt Request
        DCD     USB0_IRQHandler                               ;USB: HSUSB Interrup request
        DCD     USB1_IRQHandler                               ;USB: eUSB Interrup request
        DCD     WDT2_IRQHandler                               ;WDT: Interrupt request
        DCD     WDT3_IRQHandler                               ;WDT: Interrupt request
        DCD     USBPHY0_IRQHandler                            ;HSUSBPHY: UTM interrupt request
        DCD     Reserved55_IRQHandler                         ;xxx Interrupt 55
        DCD     I3C3_IRQHandler                               ;I3C: Interrupt Request
        DCD     FLEXIO_IRQHandler                             ;flexio: Interrupt request
        DCD     LCDIF_IRQHandler                              ;dcn: Interrupt request
        DCD     VGPU_IRQHandler                               ;VGPU interrupt from graphics core
        DCD     MIPI_IRQHandler                               ;DSI: Interrupt request
        DCD     EDMA2_CH0_IRQHandler                          ;edma2: Channel 0 interrupt
        DCD     EDMA2_CH1_IRQHandler                          ;edma2: Channel 1 interrupt
        DCD     EDMA2_CH2_IRQHandler                          ;edma2: Channel 2 interrupt
        DCD     EDMA2_CH3_IRQHandler                          ;edma2: Channel 3 interrupt
        DCD     EDMA2_CH4_IRQHandler                          ;edma2: Channel 4 interrupt
        DCD     EDMA2_CH5_IRQHandler                          ;edma2: Channel 5 interrupt
        DCD     EDMA2_CH6_IRQHandler                          ;edma2: Channel 6 interrupt
        DCD     EDMA2_CH7_IRQHandler                          ;edma2: Channel 7 interrupt
        DCD     EDMA3_CH0_IRQHandler                          ;edma3: Channel 0 interrupt
        DCD     EDMA3_CH1_IRQHandler                          ;edma3: Channel 1 interrupt
        DCD     EDMA3_CH2_IRQHandler                          ;edma3: Channel 2 interrupt
        DCD     EDMA3_CH3_IRQHandler                          ;edma3: Channel 3 interrupt
        DCD     EDMA3_CH4_IRQHandler                          ;edma3: Channel 4 interrupt
        DCD     EDMA3_CH5_IRQHandler                          ;edma3: Channel 5 interrupt
        DCD     EDMA3_CH6_IRQHandler                          ;edma3: Channel 6 interrupt
        DCD     EDMA3_CH7_IRQHandler                          ;edma3: Channel 7 interrupt
        DCD     GPIO80_IRQHandler                             ;rgpio8: Interupt request, channel 0
        DCD     GPIO81_IRQHandler                             ;rgpio8: Interupt request, channel 1
        DCD     GPIO90_IRQHandler                             ;rgpio9: Interupt request, channel 0
        DCD     GPIO91_IRQHandler                             ;rgpio9: Interupt request, channel 1
        DCD     GPIO100_IRQHandler                            ;rgpio10: Interupt request, channel 0
        DCD     GPIO101_IRQHandler                            ;rgpio10: Interupt request, channel 1
        DCD     Reserved83_IRQHandler                         ;Reserved interrupt 83
        DCD     Reserved84_IRQHandler                         ;Reserved interrupt 84
        DCD     PIN_INT0_IRQHandler                           ;pint1: Interupt request 0
        DCD     PIN_INT1_IRQHandler                           ;pint1: Interupt request 1
        DCD     PIN_INT2_IRQHandler                           ;pint1: Interupt request 2
        DCD     PIN_INT3_IRQHandler                           ;pint1: Interupt request 3
        DCD     SAI3_IRQHandler                               ;sai3: TX/RX interrupt
        DCD     XSPI2_IRQHandler                              ;xspi2: Ored interrupt
        DCD     MMU2_IRQHandler                               ;mmu2: Interrupt request
        DCD     Reserved92_IRQHandler                         ;Reserved interrupt
        DCD     GDET3_IRQHandler                              ;GDET3: Interrupt request
        DCD     CDOG3_IRQHandler                              ;cdog3: Interrupt request
        DCD     CDOG4_IRQHandler                              ;cdog4: Interrupt request
        DCD     Reserved96_IRQHandler                         ;Reserved interrupt 96
        DCD     CPU1_IRQHandler                               ;CTI interrupt request
        DCD     JPEGDEC_IRQHandler                            ;JPEGDEC Ored context 0-3 interrupt request
        DCD     PNGDEC_IRQHandler                             ;PNGDEC interrupt request
        DCD     Reserved100_IRQHandler                        ;Reserved interrupt 100
        DCD     TEMPDET0_IRQHandler                           ;TEMPDET0: Temperature Detect Interrupt request 0
        DCD     TEMPDET1_IRQHandler                           ;TEMPDET1: Temperature Detect Interrupt request 1
        DCD     EZHV_IRQHandler                               ;ezhv: Interrupt request
        DCD     SLEEPCON1_IRQHandler                          ;SLEEPCON_SENSE CPU1 wakeup event
        DCD     PVTS1_CPU1_IRQHandler                         ;PVTS1 CPU1 interrupt
        DCD     Reserved106_IRQHandler                        ;Reserved interrupt 106
        DCD     PVTS1_HIFI1_IRQHandler                        ;PVTS1 HIFI1 interrupt
        DCD     Reserved108_IRQHandler                        ;Reserved interrupt 108
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

