Masmiseim36/nxpSDK/devices/MIMXRT758S/iar/startup_MIMXRT758S_cm33_core1.s
        PUBWEAK Reserved108_IRQHandler
        PUBWEAK Reserved108_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved108_IRQHandler
        LDR     R0, =Reserved108_DriverIRQHandler
        BX      R0

Reserved16_DriverIRQHandler
Reserved17_DriverIRQHandler
Reserved18_DriverIRQHandler
FRO2_DriverIRQHandler
GLIKEY4_DriverIRQHandler
UTICK1_DriverIRQHandler
MRT1_DriverIRQHandler
CTIMER5_DriverIRQHandler
CTIMER6_DriverIRQHandler
CTIMER7_DriverIRQHandler
LPI2C15_DriverIRQHandler
LP_FLEXCOMM17_DriverIRQHandler
LP_FLEXCOMM18_DriverIRQHandler
LP_FLEXCOMM19_DriverIRQHandler
LP_FLEXCOMM20_DriverIRQHandler
ADC_DriverIRQHandler
SDADC_DriverIRQHandler
GLIKEY1_DriverIRQHandler
ACMP_DriverIRQHandler
PDM_EVENT_DriverIRQHandler
HYPERVISOR_DriverIRQHandler
SECURE_VIOLATION_DriverIRQHandler
PDM_HWVAD_EVENT_DriverIRQHandler
RTC1_ALARM_DriverIRQHandler
RTC1_DriverIRQHandler
HIFI1_DriverIRQHandler
MU1_B_DriverIRQHandler
Reserved43_DriverIRQHandler
MU3_A_DriverIRQHandler
PMC_DriverIRQHandler
OS_EVENT_DriverIRQHandler
USDHC0_DriverIRQHandler
USDHC1_DriverIRQHandler
I3C2_DriverIRQHandler
USB0_DriverIRQHandler
USB1_DriverIRQHandler
WDT2_DriverIRQHandler
WDT3_DriverIRQHandler
USBPHY0_DriverIRQHandler
Reserved55_DriverIRQHandler
I3C3_DriverIRQHandler
FLEXIO_DriverIRQHandler
LCDIF_DriverIRQHandler
VGPU_DriverIRQHandler
MIPI_DriverIRQHandler
EDMA2_CH0_DriverIRQHandler
EDMA2_CH1_DriverIRQHandler
EDMA2_CH2_DriverIRQHandler
EDMA2_CH3_DriverIRQHandler
EDMA2_CH4_DriverIRQHandler
EDMA2_CH5_DriverIRQHandler
EDMA2_CH6_DriverIRQHandler
EDMA2_CH7_DriverIRQHandler
EDMA3_CH0_DriverIRQHandler
EDMA3_CH1_DriverIRQHandler
EDMA3_CH2_DriverIRQHandler
EDMA3_CH3_DriverIRQHandler
EDMA3_CH4_DriverIRQHandler
EDMA3_CH5_DriverIRQHandler
EDMA3_CH6_DriverIRQHandler
EDMA3_CH7_DriverIRQHandler
GPIO80_DriverIRQHandler
GPIO81_DriverIRQHandler
GPIO90_DriverIRQHandler
GPIO91_DriverIRQHandler
GPIO100_DriverIRQHandler
GPIO101_DriverIRQHandler
Reserved83_DriverIRQHandler
Reserved84_DriverIRQHandler
PIN_INT0_DriverIRQHandler
PIN_INT1_DriverIRQHandler
PIN_INT2_DriverIRQHandler
PIN_INT3_DriverIRQHandler
SAI3_DriverIRQHandler
XSPI2_DriverIRQHandler
MMU2_DriverIRQHandler
Reserved92_DriverIRQHandler
GDET3_DriverIRQHandler
CDOG3_DriverIRQHandler
CDOG4_DriverIRQHandler
Reserved96_DriverIRQHandler
CPU1_DriverIRQHandler
JPEGDEC_DriverIRQHandler
PNGDEC_DriverIRQHandler
Reserved100_DriverIRQHandler
TEMPDET0_DriverIRQHandler
TEMPDET1_DriverIRQHandler
EZHV_DriverIRQHandler
SLEEPCON1_DriverIRQHandler
PVTS1_CPU1_DriverIRQHandler
Reserved106_DriverIRQHandler
PVTS1_HIFI1_DriverIRQHandler
Reserved108_DriverIRQHandler
DefaultISR
        B .

        END
